//指定した都道府県の天気を取得するタグを作成する
//取得した天気はメッセージテキスト化する

//TYRANO.kag.ftag.master_tag.タグ名 でタグを作成する。なお、中身は連想配列
TYRANO.kag.ftag.master_tag.weather = {

    //タグに必須の引数の設定
    vital : ["area"],

    //タグに使用する引数の設定
    pm : {
        area:"" //取得する地域名。
    },

    //タグの処理
    start : function(pm){
        // 都道府県ごとの地域コード
        var area_code = {
            "北海道":"016000",      // 北海道は札幌(officeCode:016000)のみの取得とする
            "青森":"020000",
            "岩手":"030000",
            "宮城":"040000",
            "秋田":"050000",
            "山形":"060000",
            "福島":"070000",
            "茨城":"080000",
            "栃木":"090000",
            "群馬":"100000",
            "埼玉":"110000",
            "千葉":"120000",
            "東京":"130000",
            "神奈川":"140000",
            "新潟":"150000",
            "富山":"160000",
            "石川":"170000",
            "福井":"180000",
            "山梨":"190000",
            "長野":"200000",
            "岐阜":"210000",
            "静岡":"220000",
            "愛知":"230000",
            "三重":"240000",
            "滋賀":"250000",
            "京都":"260000",
            "大阪":"270000",
            "兵庫":"280000",
            "奈良":"290000",
            "和歌山":"300000",
            "鳥取":"310000",
            "島根":"320000",
            "岡山":"330000",
            "広島":"340000",
            "山口":"350000",
            "徳島":"360000",
            "香川":"370000",
            "愛媛":"380000",
            "高知":"390000",
            "福岡":"400000",
            "佐賀":"410000",
            "長崎":"420000",
            "熊本":"430000",
            "大分":"440000",
            "宮崎":"450000",
            "鹿児島":"460000",
            "沖縄":"471000",      // 沖縄は那覇と石垣があるが、那覇(officeCode:471000)のみの取得とする
        };

        //指定された都道府県が別だった場合デフォルトの東京に設定する
        if(area_code[pm.area] == undefined){ pm.area = "東京" };

        var url = "https://www.jma.go.jp/bosai/forecast/data/forecast/"+ area_code[pm.area] +".json";

        fetch(url)
            .then(function(response){
                return response.json();
            })
            .then(function(weather){
                area = weather[0].timeSeries[0].areas[0];
                //テキストとして天気を表示する
                TYRANO.kag.ftag.startTag("text",{val:area.weathers[0]});
            });
    }
}
